PhoneNumberFormatException.PHONE_NUMBER_IS_EMPTY=Numer telefonu jest pusty
PhoneNumberFormatException.UNESPECTED_CHAR=Wyst\u0105pi\u0142 nieoczekiwany znak "{0}" na pozycji\: {1}
PhoneNumberFormatException.COUNTRY_PREFIX_CHAR_NOT_FOUND=Brak znaku prefiksu kraju "{0}"
PhoneNumberFormatException.NUMBER_TO_SHORT=Numer za krótki
PhoneNumberFormatException.NUMBER_TO_LONG=Numer za d\u0142ugi
TMobileSMSGatewayErrorCode.SUCCESS=Wysy\u0142ka bez b\u0142\u0119du
TMobileSMSGatewayErrorCode.SYSTEM_ERROR=awaria systemu
TMobileSMSGatewayErrorCode.USER_NOT_AUTHORISED=u\u017Cytkownik nieautoryzowany
TMobileSMSGatewayErrorCode.ACCESS_BLOCKED=dost\u0119p zablokowany
TMobileSMSGatewayErrorCode.SYNTAX_ERROR=b\u0142\u0105d sk\u0142adni
TMobileSMSGatewayErrorCode.LIMITION_EXCEEDED=wyczerpany limit
TMobileSMSGatewayErrorCode.WRONG_RECIPIENT_ADDRESS=b\u0142\u0119dny adres odbiorcy lub odbiorca nie wyrazi\u0142 zgody na otrzymywanie informacji handlowych
TMobileSMSGatewayErrorCode.MESSAGE_TO_LONG=wiadomo\u015B\u0107 zbyt d\u0142uga
TMobileSMSGatewayErrorCode.NO_ENOUGHT_COINS=brak wymaganej liczby \u017Ceton\u00F3w
GSMServiceReturnCode.NO_ENOUGH_RESOURCES_ON_ACCOUNT=Brak wystarczaj\u0105cych \u015Brodk\u00F3w na koncie w Bramce SMS
GSMServiceReturnCode.SYNTAX_TECHNICAL_ERROR=B\u0142\u0105d techniczny w sk\u0142adni SMSa
GSMServiceReturnCode.SMS_SEND_SUCCESS=SMS zosta\u0142 wys\u0142any
GSMServiceReturnCode.NETWORK_UNAVAILABLE=Sie\u0107, do kt\u00F3rej pr\u00F3bowano wys\u0142a\u0107 SMSa jest obecnie niedost\u0119pna
GSMServiceReturnCode.WRONG_RECIPIENT_NUMER=Numer odbiorcy jest nieprawid\u0142owy
GSMServiceReturnCode.NO_SMS_CONTENT=Brak tre\u015Bci SMSa
GSMServiceReturnCode.DELIVER_PROBLEM=Problem z dor\u0119czeniem SMSa (abonent ma wy\u0142\u0105czony telefon, jest poza zasi\u0119giem sieci, jego numer zosta\u0142 przeniesiony lub jego skrzynka odbiorcza jest przepe\u0142niona itp.)
GSMServiceReturnCode.WRONG_AUTH_DATA=Nieprawid\u0142owy Login lub/i has\u0142o do subkonta API
GSMServiceReturnCode.WRONT_SMS_TYPE=Nieprawid\u0142owy rodzaj SMSa
GSMServiceReturnCode.WAIT_IN_QUEUE=SMS oczekuje w kolejce na wys\u0142anie
GSMServiceReturnCode.WAIT_FOR_STATUS=Trwa oczekiwanie na zwr\u00F3cenie statusu SMSa przez sie\u0107 GSM
GSMServiceReturnCode.SMS_CANCELED_BY_USER=Wiadomo\u015B\u0107 anulowana przez u\u017Cytkownika
SMSGatewayException.UNKNOWN_SEND_STATUS=Nieznany status wyslania wiadomosci
SMSGatewayException.NOT_LOGGED=Brak zalogowania do serwera
SMSGatewayException.CERT_EXPIRED=Certyfikat serwera straci\u0142 wa\u017Cno\u015B\u0107
SMSGatewayException.CAPTCHA_REQUIRED=Wys\u0142anie SMS wymaga potwierdzenia przepisania kodu z obrazka CAPTCHA
SMSGatewayException.CAPTCHA_NOT_FOUND=Wys\u0142anie SMS wymaga potwierdzenia przepisania kodu z obrazka CAPTCHA, którego nie odnaleziono na stronie
SMSGatewayException.CAPTCHA_WRONG=Niepoprawna warto\u015B\u0107 kodu obrazka.
SMSGatewayException.USER_LOGIN_VALIDATION_ERROR=
SMSApiSMSGatewayErrorCode.EC_8=B\u0142\u0105d w odwo\u0142aniu (Prosimy zg\u0142osi\u0107)
SMSApiSMSGatewayErrorCode.EC_11=Zbyt d\u0142uga lub brak wiadomo\u015Bci lub ustawiono parametr nounicode i pojawi\u0142y si\u0119 znaki specjalne w wiadomo\u015Bci. Dla wysy\u0142ki VMS b\u0142\u0105d oznacz brak pliku WAV lub b\u0142\u0105d tekstu TTS (brak tekstu lub inne ni\u017C UTF-8 kodowanie)
SMSApiSMSGatewayErrorCode.EC_12=Wiadomo\u015B\u0107 sk\u0142ada si\u0119 z wi\u0119kszej ilo\u015Bci cz\u0119\u015Bci ni\u017C okre\u015Blono w parametrze &max_parts
PromoSMSReturnCode.RC_001=Wys\u0142ano prawid\u0142owo
PromoSMSReturnCode.RC_002=Wiadomo\u015B\u0107 prawid\u0142owo przekazana do wysy\u0142ki, jednak z przyczyn technicznych zostanie wys\u0142ana w p\u00F3\u017Aniejszym czasie (dotyczy FasterSMS)
PromoSMSReturnCode.RC_011=Nie przekazano potrzebnych parametrów - brak danych GET/POST
PromoSMSReturnCode.RC_021=Z\u0142y login lub has\u0142o
PromoSMSReturnCode.RC_022=Brak wystarczaj\u0105cych \u015Brodk\u00F3w na koncie do realizacji tego typu wysy\u0142ki
PromoSMSReturnCode.RC_023=Problem z wyslaniem wiadomo\u015Bci. Skontaktuj si\u0119 z BOK.
PromoSMSReturnCode.RC_031=Pole nadawcy jest zbyt d\u0142ugie (maksymalnie 16 znak\u00F3w przy nadawcy numerycznym i 11 znak\u00F3w przy nadawcy alfanumerycznym)
PromoSMSReturnCode.RC_032=Nie poda\u0142e\u015B/-a\u015B ani jednego adresata wiadomo\u015Bci lub podany adresat jest nieprawid\u0142owy (nieprawid\u0142owy/nieistniej\u0105cy numer kom\u00F3rkowy lub numer stacjonarny)
PromoSMSReturnCode.RC_033=Nie poda\u0142e\u015B/-a\u015B tre\u015Bci wiadomo\u015Bci
PromoSMSReturnCode.RC_034=Podano czas z przesz\u0142o\u015Bci jako preferowany czas wysy\u0142ki
PromoSMSReturnCode.RC_035=Liczba identyfikator\u00F3w w\u0142asnych jest r\u00F3\u017Cna od liczby odbiorc\u00F3w wysy\u0142anej wiadomo\u015Bci
PromoSMSReturnCode.RC_036=Zosta\u0142 wybrany typ wiadomo\u015Bci MaxSMS, ale nie zosta\u0142 okre\u015Blony nadawca wiadomo\u015Bci (maksymalnie 11 znak\u00F3w alfanumerycznych)
PromoSMSReturnCode.RC_037=Zezwalasz tylko na wysy\u0142anie wiadomo\u015Bci sk\u0142adaj\u0105cych si\u0119 z jednego SMSa, a Twoja wiadomo\u015B\u0107 jest d\u0142u\u017Csza
PromoSMSReturnCode.RC_038=Tre\u015B\u0107 wiadomo\u015Bci przekracza maksymaln\u0105 dozwolon\u0105 pod wzgl\u0119dem technicznym d\u0142ugo\u015B\u0107 (wi\u0119cej ni\u017C 4 SMSy sk\u0142adowe na wiadomo\u015B\u0107)i
PromoSMSReturnCode.RC_039=Wybra\u0142e\u015B wysy\u0142k\u0119 typu FasterSMS i r\u00F3wnocze\u015Bnie pr\u00F3bujesz wys\u0142a\u0107 wiadomo\u015B\u0107 do wi\u0119cej ni\u017C jednego adresata, co jest niedozwolone (FasterSMS s\u0142u\u017Cy do wysy\u0142ania pojedynczych wiadomo\u015Bci SMS, np. z has\u0142em jednorazowym)
PromoSMSReturnCode.RC_040=Nazwa nadawcy wiadomo\u015Bci nie zosta\u0142a zarejestrowana. Skontaktuj si\u0119 z BOK.
PromoSMSReturnCode.RC_080=Adres IP, z kt\u00F3rego przysz\u0142o wywo\u0142anie API nie znajduje si\u0119 na li\u015Bcie adres\u00F3w uprawnionych do korzystania z API. Zaloguj si\u0119 do Panelu SMS, aby skonfigurowa\u0107 ustawienia API.
PromoSMSReturnCode.RC_041=Wiadomo\u015B\u0107 zawiera znaki spoza dozwolonego zakresu znak\u00F3w UTF-8.
PromoSMSReturnCode.RC_091=B\u0142\u0105d po\u0142\u0105czenia z baz\u0105. Skontaktuj si\u0119 z firm\u0105 PromoSMS
PromoSMSReturnCode.RC_092=B\u0142\u0105d podczas wysy\u0142ki wiadomo\u015Bci. Skontaktuj si\u0119 z firm\u0105 PromoSMS
PromoSMSDeliveryStatus.DS_0=Wiadomo\u015B\u0107 nie zosta\u0142a jeszcze przekazana do wysy\u0142ki. Taki stan mo\u017Cliwy jest zaraz po zleceniu wysy\u0142ki (wiadomo\u015Bci s\u0105 przekazywane do operatora \u015Brednio co 15 sekund) lub w przypadku wiadomo\u015Bci, kt\u00F3re maj\u0105 by\u0107 wys\u0142ane w przysz\u0142o\u015Bci (parametr time przy wysy\u0142ce)
PromoSMSDeliveryStatus.DS_4=Wiadomo\u015B\u0107 zosta\u0142a przekazana do operatora. W tym momencie platforma PromoSMS czeka na realizacj\u0119 zlecenia przez operatora. Stan nr 8 mo\u017Cna por\u00F3wna\u0107 do wys\u0142ania SMS z telefonu, kiedy telefon kom\u00F3rkowy wys\u0142a\u0142 wiadomo\u015B\u0107, lecz nie otrzymali\u015Bmy jeszcze potwierdzenia dostarczenia/niedostarczenia od operatora. Ponadto, je\u017Celi odbiorca ma na przyk\u0142ad wy\u0142\u0105czony telefon, a operator pr\u00F3bowa\u0142 dostarczy\u0107 prawid\u0142owo t\u0119 wiadomo\u015B\u0107, to tak\u017Ce nale\u017Cy spodziewa\u0107 si\u0119 takiego stanu wiadomo\u015Bci
PromoSMSDeliveryStatus.DS_8=Wiadomo\u015B\u0107 zosta\u0142a przekazana do operatora. W tym momencie platforma PromoSMS czeka na realizacj\u0119 zlecenia przez operatora. Stan nr 8 mo\u017Cna por\u00F3wna\u0107 do wys\u0142ania SMS z telefonu, kiedy telefon kom\u00F3rkowy wys\u0142a\u0142 wiadomo\u015B\u0107, lecz nie otrzymali\u015Bmy jeszcze potwierdzenia dostarczenia/niedostarczenia od operatora. Ponadto, je\u017Celi odbiorca ma na przyk\u0142ad wy\u0142\u0105czony telefon, a operator pr\u00F3bowa\u0142 dostarczy\u0107 prawid\u0142owo t\u0119 wiadomo\u015B\u0107, to tak\u017Ce nale\u017Cy spodziewa\u0107 si\u0119 takiego stanu wiadomo\u015Bci\t
PromoSMSDeliveryStatus.DS_1=Status o numerze jeden oznacza, \u017Ce wiadomo\u015B\u0107 zosta\u0142a dostarczona na telefon kom\u00F3rkowy odbiorcy
PromoSMSDeliveryStatus.DS_2=Wiadomo\u015B\u0107 nie zosta\u0142a dostarczona. Przyczyn mo\u017Ce by\u0107 kilka. Najbardziej prawdopodobne to\: numer odbiorcy jest nieprawid\u0142owy telefon odbiorcy jest wy\u0142\u0105czony przez d\u0142ugi czas i wiadomo\u015B\u0107 wygas\u0142a
PromoSMSDeliveryStatus.DS_16=Wiadomo\u015B\u0107 nie zosta\u0142a dostarczona. Przyczyn mo\u017Ce by\u0107 kilka. Najbardziej prawdopodobne to\: numer odbiorcy jest nieprawid\u0142owy telefon odbiorcy jest wy\u0142\u0105czony przez d\u0142ugi czas i wiadomo\u015B\u0107 wygas\u0142a
PromoSMSPhoneType.PT_1=Numer stacjonarny
PromoSMSPhoneType.PT_2=Numer komórkowy
PromoSMSPhoneType.PT_3=W niekt\u00F3rych krajach mo\u017Cliwe jest, \u017Ce dany numer jest r\u00F3wnocze\u015Bnie numerem kom\u00F3rkowym/stacjonarnym
PromoSMSPhoneType.PT_4=Darmowy numer
PromoSMSPhoneType.PT_5=Number o podwy\u017Cszonej p\u0142atno\u015Bci
PromoSMSPhoneType.PT_6=Koszt za po\u0142\u0105czenie jest wsp\u00F3\u0142dzielony mi\u0119dzy odbiorc\u0105 i nadawc\u0105 (np. numer typu 801..)
PromoSMSPhoneType.PT_7=Numer VoIP
PromoSMSPhoneType.PT_8=Numer osobisty, mo\u017Cliwe \u017Ce jest r\u00F3wnocze\u015Bnie kom\u00F3rkowy jak i stacjonarny (patrz tutaj\: http\://en.wikipedia.org/wiki/Personal_Numbers )
PromoSMSPhoneType.PT_9=Pager
PromoSMSPhoneType.PT_10=Tzw. Universal Access Numbers lub Company Numbers (Jeden numer firmowy, ale po\u0142\u0105czenie mo\u017Ce by\u0107 odpowiednio prze\u0142\u0105czane)